var buffary=[];
function getuserinfo(){
    var soflag = arguments[0];
    var sovalue = arguments[1];
    var vurl = ['getUserInfo?soflag=',soflag,'&sovalue=',sovalue].join('');

    var info = [0,''];
    if(soflag==1){
        info[0]=sovalue;
    }else if(soflag==2){
        info[1]=sovalue;
    }

    var xhr = new XMLHttpRequest();
    xhr.open("get", vurl,true);
    xhr.onload = function(){
        if(xhr.status != 200){
            buffary.push(info.join('\t'));
            console.error([xhr.status,'=>',vurl].join(''));
            return;
        }
        var bk=JSON.parse(xhr.responseText);
        if(bk.idw>0&&bk.strw.length>0){
            if(soflag==1){
                info[1]=bk.strw;
            }else if(soflag==2){
                info[0]=bk.idw;
            }
            buffary.push(info.join('\t'));
            console.log(bk.idw,'\t',bk.strw);
            return;
        }
    }

    xhr.send(null);
}
/*
var
*/
var strws=['贺五窝','一束红颜','天赐三千','告别20115','猫生无奈','淮水居士','汉风HF','猫青菜','贺五窝','一束红颜','河谷少年','天赐三千','一束红颜','猫生欢乐','我是喜爷','郭无欢_','小叙V','金元宝本尊','正宗回锅肉V','浪高三尺三V','李司机V','东城戏子V','楼蓉蓉','财迷道长V','小叙V','匪夷V','弥撒V','萌妖V','爆炒土豆V ','疯子语V','九品一局','苗棋淼丶','鱼进江V','骑马钓鱼123','张无忍V','南凛V','香辣小龙虾V','目垂觉V','流年往事已尘封V','敢和贫道抢师太V','长策V ','猪好美V','掰着脚丫数太阳V','古小施2018','西域刀客V','皮簧','苏芸V','小叙V','银花火树biling','再见萧郎818','黑桃八号','不谷布谷','萌妞坑宝','玉面x小七郎','四殿下2018','钱宸2017','楼蓉蓉','水晶红幽灵','陆通2018','御晨风2017','生笔马靓','耀眼的星火丶','老黑泥巴','我是小表哥','不谷布谷','墨老黑泥','问东君2018','乔子轩2018','落魄的书生1','柠檬Q豆','堂前归雁','胡羊羊V','玉面x小七郎','榴莲糖果罐','蓝家三少V','鱼可可','若无Mercy','乔子轩2018','蓝家三少V','yc尉迟沁儿','慕尧2018','ty空流','一湖深水','唐颖小可爱','茯苓半夏V','耗这口2018','雪在烧呀','郑虹','凌炎2012','Q林风轻','老婆的小三儿','爱调皮的陆雪琪','荒山老狗','落梦瑶','猫狗一生','将离人愁','醉卧君怀听夜雨','半生琉璃瓦','风水扛把子','活着的木头','电视里的TV','天黑陌生人','草色如灯','知白知白','梦中彼岸人','一缺三开黑','恰同学西厢','飘摇一路','我叫吴大胆1','颜期子归','血色糕点','耗言壮志','吞鬼的女孩','郑报发','微微胖大叔','向阳的心V','谢庆生','岳家郡','娘子本尊','冷叔不怕冷','荆仓','杨又芷','路小黑','林洛V','余不愚','羽落晨兮','69号店','我是喜爷','探竹','千里明月2016','风中凌乱小橘子','迷清浅','巴山牛_渝','安宁佳佳','晓芯洋','大胡子卢梭','一个落魄文人','紫寞芳华','艾月魂A','却笑少年多情','尤小墨','十五年韩薇','蛤蟆吵湾','沾墨人','涵丹尼handenie','幽灵帝国','贰拾柒V','马若水','润笔二十八','我心无语2013','小鉴定师大宝','慕容窈窕','唐家宁','空中大鸟1','可可和老郑','游泳的猫咪ABC','大七七712','2016回家的路','阳翟先生','探竹','装龙做雅','ct19860726','一枝杏香兔儿风','i草文','玄月先生','Doris千里婵娟','太阳出来2018','幸福村小狼','ty_妙笔生','醉山川','青衫醉人离','红海的海虹','海里鲸鱼2017','蓝翔技术学院校花','醉卧君怀听夜雨','梅开时节落花','小树嫩芽儿','青蛇随身','青蛇随身','衣衫半染','山中野李','故人安','羽落晨兮','灰袍潜伏','枫林晚','我叫贝昕','啃树','三两二钱_ty','独孤求剩123','王者鉴明V','风兮重楼','我心未央8','0度抹罪','挑粪的太爷'];

for(let key in strws)getuserinfo(2,strws[key]);
